; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p9---int100n150-m25---int100c150---s184---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level1 level1 level2)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level2 level1 level3)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level3 level1 level4)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level4 level1 level5)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level5 level1 level6)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level6 level1 level7)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level7 level1 level8)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level8 level1 level9)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level9 level1 level10)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level10 level1 level11)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level11 level1 level12)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level12 level1 level13)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level13 level1 level14)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level14 level1 level15)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level15 level1 level16)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level16 level1 level17)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level17 level1 level18)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level18 level1 level19)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level19 level1 level20)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level20 level1 level21)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level21 level1 level22)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level22 level1 level23)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level23 level1 level24)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level24 level1 level25)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level25 level1 level26)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level26 level1 level27)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level27 level1 level28)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level28 level1 level29)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level29 level1 level30)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level30 level1 level31)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level31 level1 level32)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level32 level1 level33)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level14 level46)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level33 level1 level34)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level14 level47)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level34 level1 level35)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level14 level48)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level35 level1 level36)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level14 level49)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level36 level1 level37)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level14 level50)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level37 level1 level38)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level14 level51)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level38 level1 level39)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level14 level52)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level39 level1 level40)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level14 level53)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level40 level1 level41)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level14 level54)
(sum level40 level17 level57)
(sum level40 level21 level61)
(sum level41 level1 level42)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level14 level55)
(sum level41 level17 level58)
(sum level41 level21 level62)
(sum level42 level1 level43)
(sum level42 level7 level49)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level14 level56)
(sum level42 level17 level59)
(sum level42 level21 level63)
(sum level43 level1 level44)
(sum level43 level7 level50)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level14 level57)
(sum level43 level17 level60)
(sum level43 level21 level64)
(sum level44 level1 level45)
(sum level44 level7 level51)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level14 level58)
(sum level44 level17 level61)
(sum level44 level21 level65)
(sum level45 level1 level46)
(sum level45 level7 level52)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level14 level59)
(sum level45 level17 level62)
(sum level45 level21 level66)
(sum level46 level1 level47)
(sum level46 level7 level53)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level14 level60)
(sum level46 level17 level63)
(sum level46 level21 level67)
(sum level47 level1 level48)
(sum level47 level7 level54)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level14 level61)
(sum level47 level17 level64)
(sum level47 level21 level68)
(sum level48 level1 level49)
(sum level48 level7 level55)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level14 level62)
(sum level48 level17 level65)
(sum level48 level21 level69)
(sum level49 level1 level50)
(sum level49 level7 level56)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level14 level63)
(sum level49 level17 level66)
(sum level49 level21 level70)
(sum level50 level1 level51)
(sum level50 level7 level57)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level14 level64)
(sum level50 level17 level67)
(sum level50 level21 level71)
(sum level51 level1 level52)
(sum level51 level7 level58)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level14 level65)
(sum level51 level17 level68)
(sum level51 level21 level72)
(sum level52 level1 level53)
(sum level52 level7 level59)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level14 level66)
(sum level52 level17 level69)
(sum level52 level21 level73)
(sum level53 level1 level54)
(sum level53 level7 level60)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level14 level67)
(sum level53 level17 level70)
(sum level53 level21 level74)
(sum level54 level1 level55)
(sum level54 level7 level61)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level14 level68)
(sum level54 level17 level71)
(sum level54 level21 level75)
(sum level55 level1 level56)
(sum level55 level7 level62)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level14 level69)
(sum level55 level17 level72)
(sum level55 level21 level76)
(sum level56 level1 level57)
(sum level56 level7 level63)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level14 level70)
(sum level56 level17 level73)
(sum level56 level21 level77)
(sum level57 level1 level58)
(sum level57 level7 level64)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level14 level71)
(sum level57 level17 level74)
(sum level57 level21 level78)
(sum level58 level1 level59)
(sum level58 level7 level65)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level14 level72)
(sum level58 level17 level75)
(sum level58 level21 level79)
(sum level59 level1 level60)
(sum level59 level7 level66)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level14 level73)
(sum level59 level17 level76)
(sum level59 level21 level80)
(sum level60 level1 level61)
(sum level60 level7 level67)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level14 level74)
(sum level60 level17 level77)
(sum level60 level21 level81)
(sum level61 level1 level62)
(sum level61 level7 level68)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level14 level75)
(sum level61 level17 level78)
(sum level61 level21 level82)
(sum level62 level1 level63)
(sum level62 level7 level69)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level14 level76)
(sum level62 level17 level79)
(sum level62 level21 level83)
(sum level63 level1 level64)
(sum level63 level7 level70)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level14 level77)
(sum level63 level17 level80)
(sum level63 level21 level84)
(sum level64 level1 level65)
(sum level64 level7 level71)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level14 level78)
(sum level64 level17 level81)
(sum level64 level21 level85)
(sum level65 level1 level66)
(sum level65 level7 level72)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level14 level79)
(sum level65 level17 level82)
(sum level65 level21 level86)
(sum level66 level1 level67)
(sum level66 level7 level73)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level14 level80)
(sum level66 level17 level83)
(sum level66 level21 level87)
(sum level67 level1 level68)
(sum level67 level7 level74)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level14 level81)
(sum level67 level17 level84)
(sum level67 level21 level88)
(sum level68 level1 level69)
(sum level68 level7 level75)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level14 level82)
(sum level68 level17 level85)
(sum level68 level21 level89)
(sum level69 level1 level70)
(sum level69 level7 level76)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level14 level83)
(sum level69 level17 level86)
(sum level69 level21 level90)
(sum level70 level1 level71)
(sum level70 level7 level77)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level14 level84)
(sum level70 level17 level87)
(sum level70 level21 level91)
(sum level71 level1 level72)
(sum level71 level7 level78)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level14 level85)
(sum level71 level17 level88)
(sum level71 level21 level92)
(sum level72 level1 level73)
(sum level72 level7 level79)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level14 level86)
(sum level72 level17 level89)
(sum level72 level21 level93)
(sum level73 level1 level74)
(sum level73 level7 level80)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level14 level87)
(sum level73 level17 level90)
(sum level73 level21 level94)
(sum level74 level1 level75)
(sum level74 level7 level81)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level14 level88)
(sum level74 level17 level91)
(sum level74 level21 level95)
(sum level75 level1 level76)
(sum level75 level7 level82)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level14 level89)
(sum level75 level17 level92)
(sum level75 level21 level96)
(sum level76 level1 level77)
(sum level76 level7 level83)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level14 level90)
(sum level76 level17 level93)
(sum level77 level1 level78)
(sum level77 level7 level84)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level14 level91)
(sum level77 level17 level94)
(sum level78 level1 level79)
(sum level78 level7 level85)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level14 level92)
(sum level78 level17 level95)
(sum level79 level1 level80)
(sum level79 level7 level86)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level14 level93)
(sum level79 level17 level96)
(sum level80 level1 level81)
(sum level80 level7 level87)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level14 level94)
(sum level81 level1 level82)
(sum level81 level7 level88)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level14 level95)
(sum level82 level1 level83)
(sum level82 level7 level89)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level14 level96)
(sum level83 level1 level84)
(sum level83 level7 level90)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level84 level1 level85)
(sum level84 level7 level91)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level85 level1 level86)
(sum level85 level7 level92)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level86 level1 level87)
(sum level86 level7 level93)
(sum level86 level10 level96)
(sum level87 level1 level88)
(sum level87 level7 level94)
(sum level88 level1 level89)
(sum level88 level7 level95)
(sum level89 level1 level90)
(sum level89 level7 level96)
(sum level90 level1 level91)
(sum level91 level1 level92)
(sum level92 level1 level93)
(sum level93 level1 level94)
(sum level94 level1 level95)
(sum level95 level1 level96)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l3)
(fuelcost level1 l0 l3)
(connected l0 l5)
(fuelcost level11 l0 l5)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l3)
(fuelcost level17 l1 l3)
(connected l1 l4)
(fuelcost level21 l1 l4)
(connected l1 l5)
(fuelcost level10 l1 l5)
(connected l2 l4)
(fuelcost level7 l2 l4)
(connected l2 l5)
(fuelcost level7 l2 l5)
(connected l3 l0)
(fuelcost level1 l3 l0)
(connected l3 l1)
(fuelcost level17 l3 l1)
(connected l4 l1)
(fuelcost level21 l4 l1)
(connected l4 l2)
(fuelcost level7 l4 l2)
(connected l4 l5)
(fuelcost level7 l4 l5)
(connected l5 l0)
(fuelcost level11 l5 l0)
(connected l5 l1)
(fuelcost level10 l5 l1)
(connected l5 l2)
(fuelcost level7 l5 l2)
(connected l5 l4)
(fuelcost level7 l5 l4)

(at t0 l4)
(fuel t0 level96)
(= (total-cost) 0)

(at p0 l5)
(at p1 l3)
(at p2 l0)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l1)
(at p7 l0)
(at p8 l4)
)

(:goal
(and
(at p0 l0)
(at p1 l5)
(at p2 l5)
(at p3 l4)
(at p4 l1)
(at p5 l5)
(at p6 l3)
(at p7 l1)
(at p8 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 0 of 9
2. (drive t0 l4 l1 level75 level21 level96)
   deleted: (at t0 l4) (fuel t0 level96)
   added: (at t0 l1) (fuel t0 level75)
   goals met: 0 of 9
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 9
4. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 9
5. (drive t0 l1 l3 level58 level17 level75)
   deleted: (at t0 l1) (fuel t0 level75)
   added: (at t0 l3) (fuel t0 level58)
   goals met: 0 of 9
6. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 1 of 9
7. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 9
8. (drive t0 l3 l0 level57 level1 level58)
   deleted: (at t0 l3) (fuel t0 level58)
   added: (at t0 l0) (fuel t0 level57)
   goals met: 1 of 9
9. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 2 of 9
10. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 2 of 9
11. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 9
12. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 2 of 9
13. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 2 of 9
14. (drive t0 l0 l1 level43 level14 level57)
   deleted: (at t0 l0) (fuel t0 level57)
   added: (at t0 l1) (fuel t0 level43)
   goals met: 2 of 9
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 3 of 9
16. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 4 of 9
17. (drive t0 l1 l4 level22 level21 level43)
   deleted: (at t0 l1) (fuel t0 level43)
   added: (at t0 l4) (fuel t0 level22)
   goals met: 4 of 9
18. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 5 of 9
19. (drive t0 l4 l5 level15 level7 level22)
   deleted: (at t0 l4) (fuel t0 level22)
   added: (at t0 l5) (fuel t0 level15)
   goals met: 5 of 9
20. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 5 of 9
21. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 6 of 9
22. (unload p2 t0 l5)
   deleted: (in p2 t0)
   added: (at p2 l5)
   goals met: 7 of 9
23. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 8 of 9
24. (drive t0 l5 l0 level4 level11 level15)
   deleted: (at t0 l5) (fuel t0 level15)
   added: (at t0 l0) (fuel t0 level4)
   goals met: 8 of 9
25. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 9 of 9
